---
kind: other
id: Properties.T:Autodesk.Revit.DB.FootPrintRoof
source: html/9d9fbd65-f01c-00f7-5801-c4311ba1c6a5.htm
---
# FootPrintRoof Properties

The id of the assembly instance to which the element belongs.